{
  "architectures": [
    "MLCDVisionModel"
  ],
  "attention_dropout": 0.0,
  "hidden_act": "gelu",
  "hidden_size": 1024,
  "image_size": 560,
  "initializer_factor": 1.0,
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "layer_norm_eps": 1e-05,
  "model_type": "mlcd",
  "num_attention_heads": 16,
  "num_channels": 3,
  "num_hidden_layers": 24,
  "patch_size": 14,
  "projection_dim": 1024,
  "torch_dtype": "float32",
  "transformers_version": "4.44.0"
}
